/*Εκχώρηση ενός νέου στοιχείου σε μία προυπάρχων λίστα, εστω ότι εχουμε την λίστα {2,8,5} και θέλουμε να έχουμε την λίστα {5,2,8,5}, πάμε να βάλουμε ενα νέο 
νέον κόμβο στην λίστα, στην αρχή  της λίστας*/
#include<iostream>
using namespace std; 
/*Δηλώση λίστας για να την αναγνωρίζει ο Compiler */
struct lista
{
  int info ;/*Σε αυτην την μεταβλήτη αποθηκευέται το περιεχόμενο των στοιχείων της λίστας*/ 
/*Εδω δημιουργούμε ενα δείκτη ο οποίος μας βοήθαει να μεταβούμε απο τον έναν κόμβο στον αλλόν σε μία λίστα */
  lista *next;
};
/*Πάμε να δημιουργήσουμε μία συναρτήση μεσω της οποίας θα εμφανιζουμε όλες τις τιμες (info) της λίστας μας*/
void Show_AllNodes (lista *head)
{
    /*Δημιουργία βοηθητικού δείκτη, όπου με την βοήθεια του θα ανατρεχουμε σε όλα τα στοιχεία της λίστας, στην αρχή θα δείχνει όπου δείχνει και ο head */
    lista *point_each_node = head; 
    /*Οσό ο pointer αυτός δεν δείχνει σε null τιμες θα συνεχίζει και θα εμφανίζει τα στοιχεία της λίστας*/
    cout<<"Τα στοιχεία της λίστας ειναι : ";
    while (point_each_node != nullptr)
    {
        cout<<endl<<point_each_node->info;
        /*Με αυτον τον τρόπο μεταβαίνει απο το ένα στοιχείο στο επόμενο της λίστας */
        point_each_node = point_each_node ->next;
    };
}
/*επείδη θέλω να γίνεται δυναμικα η εκχωρση των
στοιχειων στην λίστα, θα χρησιμοποιήσω μία  συναρτήση και σε αυτην θα βαλω δυο παραμέτρους, η μία παραμέτρος θα ειναι το head και η αλλη το value */   
void Creat_list (lista*&head,int value)
{
/*Πάμε να δημιουργήσουμε εναν κόμβο, όπου κάθε φορα που θα καλείται αυτη η συναρτήση απο την main θα δημιουργούνται ακι οι αντίστοιχοι κόμβοι της λίστας*/
lista *Node = new lista {value,nullptr};
/*Τώρα επείδη θέλω να συνδεσω όποιο στοιχείο εκχωρει ο χρήστης με την λίστα και θα πρέπει το στοιχείο αυτό να προηγείται του παλιου head λέω το εξης*/
Node -> next = head;
/*Επέιδη θέλω κάθε ενα νέο στοιχείο μου δημιουργεί ο χρήστης ο δεικτής head να δείχνει αυτο λέω*/
head = Node; 
}

/*Πάμε στην main () */
int main()
{
    /*Δημιουργω πάλι εναν δεικτή head */
    lista *head = nullptr; /*Στην αρχή αυτός ο δείκτης δείχνει σε μία κενή λίστα */
    /*Δημιουργία μιας μεταβλήτης, η οποία δίνει στον χρήστη την δυνατότητα εκχωρησης μίας τιμής στην λίστα */
    int new_value,i=0;
    /*Επείδη δεν θελω να αφήσω τελείως ελευθερο τον χρήστη και  να μου βάλει απέιρα πράγματα μέσα στην λίστα, θα δημιουργήσω εναν μετρητη (i) 
    όπου με χρηση αυτου του μετρήτη θα δεινω την δυνατοτητα στον χρηστη να βαλει μόνο τρία στοιχεία στην λίστα */
    while(i<3)
    {
        i=i+1;
        cout<<endl<<"Δωσε μου μία τιμή για τον "<<"["<<i<<"]"<<" κόμβο της λίστας   ";
        cin>>new_value;
        /*Εφ΄όσον ο χρήστης μου δίνει αυτην την τιμή, θα καλέσω την συναρτήση μου*/
        Creat_list(head,new_value);
    }
    /*Eμφάνιση στοιχείων προυπαρχων λίστας-καλώ την συναρτήση μου  */
    Show_AllNodes (head);
    
    
     return 0;
    
}
   