/*Εκχώρηση ενός νέου στοιχείου σε μία προυπάρχων λίστα, εστω ότι εχουμε την λίστα {2,8,5} και θέλουμε να έχουμε την λίστα {5,2,8,5}*/
#include<iostream>
using namespace std;
/*Δήλωση λίστας στον Compiler*/
struct lista 
{
    /*Εδω εκχωρίζεται το περιεχόμενο των node της λίστας*/
    int info;
    /*Με την δημιουργία αυτου του δείκτη προχωράμε απο τον έναν κόμβο στον επόμενο */
    lista *next;
};
/*Πάμε να δημιουργήσουμε μία συναρτήση η οποία θα μας βοήθαει να εμφανισουμε όλα τα στοιχεία της λίστας */
void show_info(lista *head)
{
    /*Δημιουργούμε εναν νέο δείτκη ο οποίος θα μας βοήθησει να διατρέξουμε σε όλα τα στοιχεία της λίστας, στην αρχή αυτός ο δείκτης θα δείχνει
    όπου δείχνει και ο head(δηλαδή τον πρώτο κόμβο της λίστας)*/
    lista *read_all_list = head;
    /*Οσό αυτός ο δείκτης δεν βρίσκει null στοιχείο θα ανατρέχει απο κόμβο σε κόμβο και θα μας εμφανίζει το περιεχόμενο του εκαστότε κόμβου*/
    cout<<"Τα στοιχεία της λίστας ειναι ";
    while (read_all_list != nullptr)
    {
        /*εμφανισε το περιεχόμενο του εκάστοτε κόμβου */
        cout<<endl<<read_all_list->info;
        /*Ο δεικτης read_all_list πρεπεί κάθε φορα απο αυτόν τον κόμβο στον οποίον βρίσκεται να προχωράει στον επόμενο, για αυτον τον λόγο λέμε το εξής 
        read_all_list=read_all_list ->next.Εστω ότι βρισκόμαστε στον κομβο 1 και θέλουμε να πάμε στον κόμβο 2, οπότε read_all_list=1 με αυτό 
        read_all_list=read_all_list->νεχτ ειναι σαν να λέμε read_all_list = 1 -> επόμενο (που ειναι ο κόμβος 2 αρα το read_all_list κοιταει τον κόμβο 2 πλέον*/
        read_all_list = read_all_list ->next;
    };
}
    
    /*Πάμε στην main πλέον */
 int main ()
{
    /*Πάμε αρχίκα να δημιουργήσουμε την λίστα μας*/
    lista *box_1 = new lista {2,nullptr};
    lista *box_2 = new lista {8,nullptr};
    lista *box_3 = new lista {5,nullptr};
    /*Πάμε να συνδεσούμε τα στοιχεία της λίστας */
    box_1 -> next  = box_2;
    box_2 -> next  = box_3;
    box_3 -> next  = nullptr;
    /*Τώρα πάνε να δημιουργήσουμε εναν νέο κόμβο, ο οποίος θα περιεχεί τον αριθμό 5 */
    lista *NewNode = new lista {5,nullptr};
    /*Πάμε να δημιουργήσουμε εναν δείκτη πάλι τοπίκο δεικτη, μεσα στην main ο οποίος θα ειναι ο head 
    και θα δειχνει πρώτα στον παλιο (πρώτο κόμβο, όπου αυτος ήτανε ο κόμβος box_1*/
    lista *head = box_1;
    /*Τώρα θέλουμε ο νέος κόμβος να δείχνει στο head ετσι ωστε να καταλάβει ο compiler οτι αυτός ο δείτης προηγείται*/
    NewNode -> next = head;
    /*Τώρα θέλουμε ο δεικτης head να δείχνει το NewΝode όποτε θα πούμε  */
    head = NewNode; 
    /*Καλούμε την συναρτήση Show_info προκειμένου να εμφανίσουμε τα στοιχεία της λίστας */
    show_info(head);
    
    
    return 0; 
}