/* Ασκήση 1- Ευρέση Μέσου όρου 3 αριθμών-Χωρις χρήση οποιασδήποτε συνθήκης επανάληψης,χωρις πίνακες, χωρίς συναρτήσεις, χωρίς δεικτες*/

#include<iostream>
using namespace std;
int main()
{
    /*Ορίζω στο πρόγραμμα μου τις μεταβλήτες στις οποίες θα αποθηκευτούνε οι αριθμοί που θα μου δώσει ο Χρήστης-num_1,num_2,num_3,sum=0 (Παντα αρχικοποιουμε την τιμή του 
    για να είμαστε 100% σιγουρη ότι δεν κουβαλάει κάποια τιμη..το ίδιο κάνουμε και για το avg=0 (που είναι ο μέσος όρος)) */
    int num_1,num_2,num_3,sum=0;
    float avg=0;
    cout<<"Δώσε μου τρεις ακέραιους αριθμούς ";
    /*O χρήστης στην οθονούλα που του παρεχει ο υπολογιστης να εισαγει τους αριθμούς...θα βάζει τον κάθε εναν αριθμό και πατωντας 
    Enter θα δημιουργείται εισόδος για να μπάινει ο επόμενος αριθμός */
    cin>>num_1>>num_2>>num_3;
    /*Εμφανίζουμε στην οθόνη τους αριθμούς που μας εδωσε ο χρήστης */
    cout<<"Ο πρωτος αριθμός που έδωσες ειναι: "<<num_1<<endl;cout<<"Ο δευτέρος αριθμός που μας εδωσες ειναι: "<<num_2<<endl;cout<<"Ο τρίτος αριθμός που μας εδωσες είναι: "<<num_3<<endl;
    sum=(num_1+num_2+num_3);
    avg= (float)sum/3; /*Αν έλεγα avg= sum/3.0 ; θα παιρνάμε ακριβώς το ίδιο αποτέλεσμα */
    cout<<"O μέσος όρος είναι: "<<avg;
return 0;
}
/*Ο λόγος για τον οποίον κάναμε το εξής avg= (float)sum/3; η" Αν έλεγα avg= sum/3.0 είναι επειδη ζητησαμε απο τον χρήστη να μας δώσει τρεις ακέραιους αριθμόυς και δημιουργήσαμε
 στον Compiler τεσσερίς  ακέραιες μεταβλήτες (int num_1,num_2,num_3,sum=0 ). Προκειμένου να πάρουμε σωστα (με δεκαδική ακρίβεια ) τον μέσο όρο...πρεπει η μεταβλήτη στην οποία 
 αποθηκευεται ο μέσος όρος να ειναι πραγματικος αριθμός (float)--->float avg. Παρόλο που το δηλώνουμε την μεταβλήτη αυτη να ειναι τυπος float αν πάμε μα διαιρέσουμε εναν ακεραιο
 αριθμό όπως το sum μέ εναν αλλον ακέραιο αριθμό όπως το 3-->sum/3 θα πάρουμε σαν αποτελεσμά μόνο το ακέραιο μέρος του αποτελέσματος, πχ αν num_1 = 5, num_2 = 6, num_3 = 11 αν 
 ΔΕΝ πουμε avg= (float)sum/3 θα παιρνάμε σαν αποτελεσμα, ο μέσος όρος ειναι 7 ενω αν το κάνουμε (όπως στην ασκήση) θα πάρουμε αποτέλεσμα, ο μέσος όρος ειναι 7,33
  */
  
  
 /*Aσκήση 2 Ευρεση μέσου όρου 3 αριθμών με χρήση της δομής επαναλήψης for */
  
  
  #include<iostream>
using namespace std;
int main()
{
    /*Ορίζω στο πρόγραμμα μου την μεταβλήτη num,sum και i  */
    int num,sum=0,i;
    float avg=0;
    /*Χρήση δομής επανάληψης for για να γλιτώσουμε χρόνο, χώρο  και κόπο*/
    for (i=0;i<3;i++)
    {
        cout<<"Δώσε μου εναν αριθμό "<<endl;

        cin>>num;
        sum=sum+num;
    }
    avg=sum/3.0;
    cout<<"O μέσος όρος ειναι: "<<avg;
    
    return 0; 
}

/*Τώρα πάμε να δουμε λίγο την λόγικη της δομής επανάληψης For 
Ουσιαστίκα τι λέει εδω;  
for (i=0;i<3;i++)
    {
        cout<<"Δώσε μου εναν αριθμό "<<endl;

        cin>>num;
        sum=sum+num;
    } 
    Ξεκινάει για i=0(1η φορα)-(μετρήτης)
    for (i=0;0<3;i++) /Το 0 ειναι μικρότερο του 3 αρα μπαίνει μέσα στην δομη επαναλήψης της for 
    {
        cout<<"Δώσε μου εναν αριθμό "<<endl;

        cin>>num; /Εστώ δίνει ο χρήστης τον αριθμό 5, όποτε num=5/
        sum=sum+num; /To sum στην αρχη του προγραμματος ειχε αρχικοποιήθει με τιμή 0 οπότε εχουμε sum= 0 +5==> sum=5
    } 
    Ξανα ανεβαίνει ο Compiler στο υψος της δομής της For πλέον με i=1 
     Για ι=1 (2η φορα)-(μετρήτης)
    for (i=1;1<3;i++) /Το 1 ειναι μικρότερο του 3 αρα μπαίνει μέσα στην δομη επαναλήψης της for 
    {
        cout<<"Δώσε μου εναν αριθμό "<<endl;

        cin>>num; /Εστώ δίνει ο χρήστης τον αριθμό 6, όποτε num=6/
        sum=sum+num; /To sum πλέον έχει την τιμή  5 οπότε εχουμε sum= 5+6 (την νέα τιμή)==> sum=11
    } 
     Ξανα ανεβαίνει ο Compiler στο υψος της δομής της For πλέον με i=2 
     Για ι=2 (3η φορα)-(μετρήτης)
    for (i=2;2<3;i++) /Το 2 ειναι μικρότερο του 3 αρα μπαίνει μέσα στην δομη επαναλήψης της for 
    {
        cout<<"Δώσε μου εναν αριθμό "<<endl;

        cin>>num; /Εστώ δίνει ο χρήστης τον αριθμό 6, όποτε num=7/
        sum=sum+num; /To sum πλέον έχει την τιμή  11 οπότε εχουμε sum= 11+7 (την νέα τιμή)==> sum=18
    } 
     Ξανα ανεβαίνει ο Compiler στο υψος της δομής της For πλέον με i=3 
     Για ι=3 (4η φορα)-(μετρήτης)
    for (i=3;3=/3;i++) /Το 3 δεν ειναι μικρότερο του 3 αρα  ΔΕΝ (ΠΡΟΣΟΧΗ) ξανα μπαίνει μέσα στην δομη επαναλήψης της for!!!!!!!
    οπότε την παραβλέπει όλην την δομή της for που ειναι η παρακάτω 
     for (i=0;i<3;i++)
    {
        cout<<"Δώσε μου εναν αριθμό "<<endl;

        cin>>num;
        sum=sum+num;
    }
    
    και πάει απευθείας στην εντολή
    avg=sum/3.0; το sum την τελευταία φορα που είμασταν μεσα στην δομή της είχε τιμη 18  
    όποτε avg=18/3.0;==> avg=6.0
    Συνεχίζει ο compiler στην επόμενη εντολή που ειναι 
    cout<<"O μέσος όρος ειναι: "<<avg; ==>O μέσος όρος ειναι: 6

     */
	 
/*Ασκήση 3 - Ευρεση μέσου όρου 3 αριθμών με χρήση της δομής επαναλήψης do-while */
	 
	 
#include<iostream>
using namespace std;
int main()
{
    /*Ορίζω στο πρόγραμμα μου την μεταβλήτη num,sum και i  */
    int num,sum=0,i=0;
    float avg=0;
    /*Χρήση δομής επανάληψης do-while για να γλιτώσουμε χρόνο, χώρο  και κόπο*/
    do 
    {
        i=i+1;
        cout<<"Δώσε μου εναν αριθμό "<<endl;

        cin>>num;
        sum=sum+num;
    } while (i<3);
    avg=sum/3.0;
    cout<<"O μέσος όρος ειναι: "<<avg;
    
    return 0; 
}
/*Πάμε να δούμε την λόγικη της δομής επαναλήψης do-while 

do 
    {
        i=i+1;
        cout<<"Δώσε μου εναν αριθμό "<<endl;

        cin>>num;
        sum=sum+num;
    } while (i<3);
    
     
     Στην αρχή του προγράμματος εκεί που ορίσαμε τις μεταβλήτες που θα χρησιμοποίηθουνε μέσα στο πρόγραμμα, κάναμε μία αρχικοποίηση της μεταβλήτης i = 0 -Με το που ξεκινάει η δομη 
     της do γίνεται μία αυξήση του i => i= i + 1 ==> i= 0 + 1 ==> i = 1 προχωράμε μέσα στην δομή - ζηταμε εναν αριθμό..τον λαμβάνουμε αυτον τον αριθμό μέσω της cin. Εστω ο χρήστης 
     μας εδωσε μία τιμη 5, όποτε με το που συναντάμε στο sum = sum + num ==> sum = 0 + 5 sum = 5 προχωράμε και συναντάμε την while (i<3)==> while (εώς ότου 1<3) δηλαδή όσο ειναι
     το i μικρότερο  απο το 3 - Ξανα μπάινουμε μέσα στην δομη της do-while πλέον το i= i + 1 ==> i = 1 + 1 ==> i = 2  επαναλαμβάνονται όλα όσα εγιναν και την πρώτη φορα, εστω ο χρηστης
     πλέον δίνει τον αριθμό 6, όποτε sum = sum + num ==> sum = 5 + 6 ==> sum = 11 πηγαίνουμε μέτα στην  while (i<3) ==> while (2<3) όποτε είμαστε οκ ξανα μπάινουμε μέσα στην
     δομή do---- i= i + 1 ==> i= 2 + 1 i = 3 επαναλαμβάνονται όλα αυτα που ειπαμε και προηγουμενως, εστω ο χρηστης δίνει πλέον τον αριθμό 7 οποτε sum = sum + num ==> sum = 11 + 7
     sum = 18 συνεχίζουμε  while (3<3)==> while (εώς ότου 3<3) 
     ΤΩΡΑ ΟΜΩΣ ΠΡΟΣΟΧΗ ΟΤΑΝ ΣΥΝΑΝΤΑΜΕ ΤΗΝ WHILE ==> while(i<3) ==> while (3<3) AΥΤΟ ΔΕΝ ΙΣΧΥΕΙ, ΔΙΟΤΙ ΤΟ 3 ΔΕΝ ΕΙΝΑΙ ΜΙΚΡΟΤΕΡΟ ΤΟΥ 3 ΟΠΟΤΕ Η ΔΟΜΗ "ΣΚΑΕΙ-ΣΤΑΜΑΤΑΕΙ ΝΑ ΕΚΤΕΛΕΙΤΑΙ"-
     ΟΜΩΣ ΕΠΕΙΔΗ ΠΡΩΤΟΥ!!!!ΣΚΑΣΕΙ ΕΚΑΝΕ ΟΛΕΣ ΤΙΣ ΠΡΑΞΕΙΣ - ΔΗΛΑΔΗ αποθηκευσαι τον αριθμό 7 μετα πηγε στην εντολή sum = 11 + 7 == >sum = 18 το sum εχει ως τελευταία τιμή την τιμη 
  sum = 18 οπότε τωρα που εσκασε και πήγε στην εντολή avg=sum/3.0 ==> avg=18/3.0 avg= 6   */


/*Ασκήση 4 - Ευρεση μέσου όρου 3 αριθμών με χρήση της δομής επαναλήψης while */	 
	 
#include<iostream>
using namespace std;
int main()
{
    /*Ορίζω στο πρόγραμμα μου την μεταβλήτη num,sum και i  */
    int num,sum=0,i=0;
    float avg=0;
    /*Χρήση δομής επανάληψης do-while για να γλιτώσουμε χρόνο, χώρο  και κόπο*/
    while(i<3) 
    {
        i=i+1;
        cout<<"Δώσε μου εναν αριθμό "<<endl;

        cin>>num;
        sum=sum+num;
    } 
    avg=sum/3.0;
    cout<<"O μέσος όρος ειναι: "<<avg;
    
    return 0; 
}
/*Πάμε να δούμε την λόγικη της δομής επαναλήψης while 
while(i<3) 
    {
        i=i+1;
        cout<<"Δώσε μου εναν αριθμό "<<endl;

        cin>>num;
        sum=sum+num;
    }
    για i = 0 εστω ο χρηστης μας δίνει τον αριθμο 3 (num)
    while(0<3) 
    {
        i=0+1; ==>i = 1
        cout<<"Δώσε μου εναν αριθμό "<<endl;

        cin>>num; ==> num = 3
        sum=sum+num; ==> sum = 0 + 3 ==> sum = 3
    }
     για i = 1 εστω ο χρηστης μας δίνει τον αριθμο 5 (num)
    while(1<3) 
    {
        i=1+1; ==>i = 2
        cout<<"Δώσε μου εναν αριθμό "<<endl;

        cin>>num; ==> num = 5
        sum=sum+num; ==> sum = 3 + 5 ==> sum = 8
    }
     για i = 2 εστω ο χρηστης μας δίνει τον αριθμο 10 (num)
    while(1<3) 
    {
        i=2+1; ==>i = 3
        cout<<"Δώσε μου εναν αριθμό "<<endl;

        cin>>num; ==> num = 10
        sum=sum+num; ==> sum = 8 + 10 ==> sum = 18
    }
     για i = 3 εστω ο χρηστης μας δίνει τον αριθμο 10 (num)
    while(3<3) ΔΕΝ ΙΣΧΥΕΙ ΤΟ 3 ΔΕΝ ΕΙΝΑΙ ΜΙΚΡΟΤΕΡΟ ΤΟΥ 3 ΟΠΟΤΕ ΔΕΝ ΞΑΝΑ ΜΠΑΙΝΕΙ ΜΕΣΑ ΣΤΗΝ ΔΟΜΗ ΤΗΣ while , οποτε συνεχίζει στην εντολη της avg
    {
        
    }
*/

/*Ασκήση 5 - Ευρεση μέσου όρου 3 αριθμών με χρήση της δομής επαναλήψης while και με χρήση πίνακα  */

#include<iostream>
using namespace std;
int main()
{
    /*Ορίζω στο πρόγραμμα μου την μεταβλήτη num,sum και i  */
    int sum=0,i=0,array [2];
    float avg=0;
    /*Χρήση δομής επανάληψης while για να γλιτώσουμε χρόνο, χώρο  και κόπο*/
    while(i<3) 
    {
        
        cout<<"Δώσε μου εναν αριθμό "<<endl;

        cin>>array[i];
        
        sum=sum+array [i] ;
        
        i=i+1;
    } 
    avg=sum/3.0;
    cout<<"O μέσος όρος ειναι: "<<avg;
    
    return 0; 
}
/*Πάμε λίγο να δουμε την λόγικη της δομής επαναλήψης while με χρήση ενος μονοδιαστάτου πίνακα 

Αρχίκα θα πρεπει να διευκρινήσουμε το εξής οταν χρησιμοποιούμε πίνακες 
ο Compiler ΑΠΑΙΤΕΙ (τουλάχιστον στο επιπέδο προγραμματισμού που έχουμε μέχρι στιγμής να τον ενημερωσουμε για το μέγεθος του πίνακα μας, προκείμενου να πάει να δεσμέυσει απο την RAM 
αυτον τον χώρο. Στην συγκεκριμένη ασκήση θελούμε να χρησιμοποιήσουμε εναν πίνακα ακέραιων, συγκεκριμένα θέλουμε αυτός ο πίνακας να έχει 3 αριθμούς...οπότε λέμε στην δηλωση 
των μεταβλήτων array [2]. Ο λόγος που λέμε array [2] ειναι επείδη το πρώτο στοιχείο του πίνακα ειναι το κέλι 0 (ξεκινάει η αρίθμηση απο το 0 ==> 
array [2] = array [0], array [1], array [2]). Οπότε αν θέλαμε ο πίνακας μας να είχε τους αριθμούς 5, 6, 7  αυτοί οι αριθμοί στον πίνακα μας θα αποθηκευόταν
array [0] = 5  array [1] = 6 array [2] = 7 ==> οποτε εν συντομία ο πίνακας μας θα ήτανε array [2] = {5,6,7}*/
/* while(i<3) 
    {
        
        cout<<"Δώσε μου εναν αριθμό "<<endl;

        cin>>array[i];
        
        sum=sum+array [i] ;
        
        i=i+1;
    } 

    Για i = 0 
    /* while (0<3) ==> το 0 ειναι μικρότερο του 3 αρα μπάινει μέσα στην δομή επαναλήψης 
    {
        
        cout<<"Δώσε μου εναν αριθμό "<<endl;

        cin>>array[0]; εστω ο χρήστης δίνει τον αριθμό 5 ==> array[0] = 5 
        
        sum=sum+array [0] ; ==> sum=0+5 ==> sum = 5 
        
        i=0+1 ==> i =1 ;
    } 
    Για i = 1 
    /* while (1<3) ==> το 1 ειναι μικρότερο του 3 αρα μπάινει μέσα στην δομή επαναλήψης 
    {
        
        cout<<"Δώσε μου εναν αριθμό "<<endl;

        cin>>array[1]; εστω ο χρήστης δίνει τον αριθμό 6 ==> array[1] = 6
        
        sum=sum+array [1] ; ==> sum=5+6 ==> sum = 11 
        
        i=1+1 ==> i =2 ;
    } 
    Για i = 2
    /* while (2<3) ==> το 2 ειναι μικρότερο του 3 αρα μπάινει μέσα στην δομή επαναλήψης 
    {
        
        cout<<"Δώσε μου εναν αριθμό "<<endl;

        cin>>array[2]; εστω ο χρήστης δίνει τον αριθμό 7 ==> array[2] = 7
        
        sum=sum+array [2] ; ==> sum= 11 + 7 ==> sum = 18 
        
        i=2+1 ==> i =3 ;
    } 
    Για i = 3
    /* while (3<3) ==> το 3 ΔΕΝ ειναι μικρότερο του 3 αρα ΔΕΝ μπάινει μέσα στην δομή επαναλήψης, οπότε συνεχίζει στην επόμενη εντολή avg=sum/3.0
    {
        
        
    } 

    ΠΡΟΣΟΧΗ-ΠΡΟΣΟΧΗ-ΠΡΟΣΟΧΗ-ΠΡΟΣΟΧΗ-ΠΡΟΣΟΧΗ-ΠΡΟΣΟΧΗ-ΠΡΟΣΟΧΗ-ΠΡΟΣΟΧΗ-ΠΡΟΣΟΧΗ-ΠΡΟΣΟΧΗ-ΠΡΟΣΟΧΗ-ΠΡΟΣΟΧΗ-ΠΡΟΣΟΧΗ-ΠΡΟΣΟΧΗ-ΠΡΟΣΟΧΗ-ΠΡΟΣΟΧΗ-ΠΡΟΣΟΧΗ-ΠΡΟΣΟΧΗ-ΠΡΟΣΟΧΗ-ΠΡΟΣΟΧΗ
    ΑΝ ειχαμε σε διαφορετική θέση τον μετρητη ( η πολύ σωστοτερα στα αγγλικα increment) μας i=i+1 όπως πχ εδω 
    while(i<3) 
    {
        i=i+1;
        
        cout<<"Δώσε μου εναν αριθμό "<<endl;

        cin>>array[i];
        
        sum=sum+array [i] ;
        
    } 
    ΘΑ ΕΙΧΑΜΕ ΠΡΟΒΛΗΜΑ ΣΤΟ ΓΕΜΙΣΜΑ ΤΟΥ ΠΙΝΑΚΑ ΓΙΑ ΤΟΝ ΕΞΗΣ ΛΟΓΟ 
    για i =0
    /* while (0<3) ==> το 0 ειναι μικρότερο του 3 αρα μπάινει μέσα στην δομή επαναλήψης 
    {
        i=0+1 ==> i =1 ;
        cout<<"Δώσε μου εναν αριθμό "<<endl;

        cin>>array[1]; εστω ο χρήστης δίνει τον αριθμό 5 ==> array[1] = 5 
        
        sum=sum+array [1] ; ==> sum=0+5 ==> sum = 5 
        
    } 
    για i =1
    /* while (1<3) ==> το 1 ειναι μικρότερο του 3 αρα μπάινει μέσα στην δομή επαναλήψης 
    {
        i=1+1 ==> i =2 ;
        cout<<"Δώσε μου εναν αριθμό "<<endl;

        cin>>array[2]; εστω ο χρήστης δίνει τον αριθμό 6 ==> array[2] = 6 
        
        sum=sum+array [2] ; ==> sum=5+6 ==> sum = 11 
        
    } 
     για i =2
    /* while (2<3) ==> το 2 ειναι μικρότερο του 3 αρα μπάινει μέσα στην δομή επαναλήψης 
    {
        i=2+1 ==> i =3 ;
        cout<<"Δώσε μου εναν αριθμό "<<endl;

        cin>>array[3]; Δεν υπάρχει array [3] οπότε θα εμφανιζε ο compiler κάποιο ERROR 
        
    } 

    Περα απο το error που θα εμφανιζότανε τo στοιχείo του πίνακα array[0] δεν θα επαίρνε ποτε μία τιμή 
	
/*Ασκήση 6 - Ευρεση μέσου όρου 3 αριθμών με χρήση της δομής επαναλήψης while και με χρήση μίας συνάρτησης χωρις παραμέτρους  */

#include<iostream>
using namespace std;
/*Ενημερώνω τον Compiler σε αυτό το σημείο για τις συναρτήσεις που σκοπευώ αν χρησιμοποιήσω μεσα στο πρόγραμμα */
float average ();
int main()
{
   /*Ορίζω τις μεταβλήτες μου, σε αυτό το πρόγραμμα. Επείδη ειναι ενα πολύ απλό προγραμμα όπου θέλω να καλω μόνο μία συναρτηση θα ορίσω μία μεταβλήτη */
    float call_function;
    cout<< "Θα καλέσω την συναρτηση average"<<endl;
    call_function = average ();
    
    
    return 0; 
}

float average () 
{
    /*Ορίζω στην συνάρτηση μου τις μεταβλήτες num,sum και i  */
    int num,sum=0,i=0;
    float avg=0;
    /*Χρήση δομής επανάληψης do-while για να γλιτώσουμε χρόνο, χώρο  και κόπο*/
    while(i<3) 
    {
        i=i+1;
        cout<<"Δώσε μου εναν αριθμό "<<endl;

        cin>>num;
        sum=sum+num;
    } 
    avg=sum/3.0;
    cout<<"O μέσος όρος ειναι: "<<avg;
    
    return avg; 
}






#include<iostream>
using namespace std;
int main()
{
    /*Ορίζω στο πρόγραμμα μου την μεταβλήτη num,sum και i  */
    int number,i =0,factorial,p=1;
    cout<<"Δώσε μου εναν αριθμό ";
     cin>>number;
     cout<<endl<< "Ο αριθμός που μου εδωσες ειναι ο "<<number;
     
         do
         {
            
         factorial = number*(number-1);
         cout<<endl<<"Γινομενο ζευγούς αριθμών   "<<factorial;
         number= (number-2);
         cout<<endl<<"Νέος αριθμός "<<number;
         p=factorial*p;
         cout<<endl<<"Το παραγόντικο θα ειναι "<<p;
         }while((number-1)==1);
         cout<<endl<<factorial;
     
    
    return 0; 
}